[
    {
        "article_id": "ARTICLE 10",
        "summary": "Freedom of thought, conscience and religion",
        "text": "Every person is entitled to freedom of thought, conscience and religion, including the freedom to have or to adopt a religion or belief of his choice."
    },
    {
        "article_id": "ARTICLE 11",
        "summary": "Freedom from torture",
        "text": "No person shall be subjected to torture or to cruel, inhuman or degrading treatment or punishment."
    },
    {
        "article_id": "ARTICLE 12",
        "summary": "Right to equality",
        "text": "(1) All persons are equal before the law and are entitled to the equal protection of the law. (2) No citizen shall be discriminated against on the grounds of race, religion, language, caste, sex, political opinion, place of birth or any one of such grounds: Provided that it shall be lawful to require a person to acquire within a reasonable time sufficient knowledge of any language as a qualification for any employment or office in the Public, Judicial or Local Government Service or in the service of any Public Corporation, where such knowledge is reasonably necessary for the discharge of the duties of such employment or office: Provided further that it shall be lawful to require a person to have a sufficient knowledge of any language as a qualification for any such employment or office where no function of that employment or office can be discharged otherwise than with a knowledge of that language. (3) No person shall, on the grounds of race, religion, language, caste, sex or any one of such grounds, be subject to any disability, liability, restriction or condition with regard to access to shops, public restaurants, hotels, places of public entertainment and places of public worship of his own religion. (4) Nothing in this Article shall prevent special provision being made, by law, subordinate legislation or executive action, for the advancement of women, children or disabled persons."
    },
    {
        "article_id": "ARTICLE 13",
        "summary": "Freedom from arbitrary arrest, detention and punishment, and prohibition of retrospective penal legislation",
        "text": "(1) No person shall be arrested except according to procedure established by law. Any person arrested shall be informed of the reason for his arrest. (2) Every person held in custody, detained or otherwise deprived of personal liberty shall be brought before the judge of the nearest competent court according to procedure established by law and shall not be further held in custody, detained or deprived of personal liberty except upon and in terms of the order of such judge made in accordance with procedure established by law. (3) Any person charged with an offence shall be entitled to be heard, in person or by an Attorney-at-Law, at a fair trial by a competent court. (4) No person shall be punished with death or imprisonment except by order of a competent court, made in accordance with procedure established by law. The arrest, holding in custody, detention or other deprivation of personal liberty of a person, pending investigation or trial, shall not constitute punishment. (5) Every person shall be presumed innocent until he is proved guilty: Provided that the burden of proving particular facts may, by law, be placed on an accused person. (6) No person shall be held guilty of an offence on account of any act or omission which did not, at the time of such act or omission, constitute such an offence and no penalty shall be imposed for any offence more severe than the penalty in force at the time such offence was committed. Nothing in this Article shall prejudice the trial and punishment of any person for any act or omission which, at the time when it was committed, was criminal according to the general principles of law recognized by the community of nations. It shall not be contravention of this Article to require the imposition of a minimum penalty for an offence provided that such penalty does not exceed the maximum penalty prescribed for such offence at the time such offence was committed. (7) The arrest, holding in custody, detention or other deprivation of personal liberty of a person, by reason of a removal order or a deportation order made under the provisions of the Immigrants and Emigrants Act or the Indo-Ceylon Agreement (Implementation) Act, No. 14 of 1967, or such other law as may be enacted in substitution therefor, shall not be a contravention of this Article."
    },
    {
        "article_id": "ARTICLE 14",
        "summary": "Freedom of speech, assembly, association, occupation, movement, & c.",
        "text": "(1) Every citizen is entitled to – (a) the freedom of speech and expression including publication; (b) the freedom of peaceful assembly; (c) the freedom of association; (d) the freedom to form and join a trade union; (e) the freedom, either by himself or in association with others, and either in public or in private, to manifest his religion or belief in worship, observance, practice and teaching; (f) the freedom by himself or in association with others to enjoy and promote his own culture and to use his own language; (g) the freedom to engage by himself or in association with others in any lawful occupation, profession, trade, business or enterprise; (h) the freedom of movement and of choosing his residence within Sri Lanka; and (i) the freedom to return to Sri Lanka. (2) A person who, not being a citizen of any other country, has been permanently and legally resident in Sri Lanka immediately prior to the commencement of the Constitution and continues to be so resident shall be entitled, for a period of ten years from the commencement of the Constitution, to the rights declared and recognized by paragraph (1) of this Article."
    },
    {
        "article_id": "ARTICLE 14A",
        "summary": "Right of access to information",
        "text": "(1) Every citizen shall have the right of access to any information as provided for by law, being information that is required for the exercise or protection of a citizen’s right held by:- (a) the State, a Ministry or any Government Department or any statutory body established or created by or under any law; (b) any Ministry of a Minister of the Board of Ministers of a Province or any Department or any statutory body established or created by a statute of a Provincial Council; (c) any local authority; and (d) any other person, who is in possession of such information relating to any institution referred to in sub-paragraphs (a), (b) or (c) of this paragraph. (2) No restrictions shall be placed on the right declared and recognized by this Article, other than such restrictions prescribed by law as are necessary in a democratic society, in the interests of national security, territorial integrity or public safety, for the prevention of disorder or crime, for the protection of health or morals and of the reputation or the rights of others, privacy, prevention of contempt of court, protection of parliamentary privilege, for preventing the disclosure of information communicated in confidence, or for maintaining the authority and impartiality of the judiciary. (3) In this Article, “citizen” includes a body whether incorporated or unincorporated, if not less than three-fourths of the members of such body are citizens."
    },
    {
        "article_id": "ARTICLE 15",
        "summary": "Restrictions on fundamental rights",
        "text": "(1) The exercise and operation of the fundamental rights declared and recognized by Articles 13(5) and 13(6) shall be subject only to such restrictions as may be prescribed by law in the interests of national security. For the purposes of this paragraph “law” includes regulations made under the law for the time being relating to public security. (2) The exercise and operation of the fundamental right declared and recognized by Article 14(1)(a) shall be subject to such restrictions as may be prescribed by law in the interests of racial and religious harmony or in relation to parliamentary privilege, contempt of court, defamation or incitement to an offence. (3) The exercise and operation of the fundamental right declared and recognized by Article 14(1)(b) shall be subject to such restrictions as may be prescribed by law in the interests of racial and religious harmony. (4) The exercise and operation of the fundamental right declared and recognized by Article 14(1)(c) shall be subject to such restrictions as may be prescribed by law in the interests of racial and religious harmony or national economy. (5) The exercise and operation of the fundamental right declared and recognized by Article 14(1)(g) shall be subject to such restrictions as may be prescribed by law in the interests of national economy or in relation to – (a) the professional, technical, academic, financial and other qualifications necessary for practising any profession or carrying on any occupation, trade, business or enterprise and the licensing and disciplinary control of the person entitled to such fundamental right; and (b) the carrying on by the State, a State agency or a public corporation of any trade, business, industry, service or enterprise whether to the exclusion, complete or partial, of citizens or otherwise. (6) The exercise and operation of the fundamental right declared and recognized by Article 14(1)(h) shall be subject to such restrictions as may be prescribed by law in the interests of national economy. (7) The exercise and operation of all the fundamental rights declared and recognized by Articles 12, 13(1), 13(2) and 14 shall be subject to such restrictions as may be prescribed by law in the interests of national security, public order and the protection of public health or morality, or for the purpose of securing due recognition and respect for the rights and freedoms of others, or of meeting the just requirements of the general welfare of a democratic society. For the purposes of this paragraph “law” includes regulations made under the law for the time being relating to public security. (8) The exercise and operation of the fundamental rights declared and recognized by Articles 12(1), 13 and 14 shall, in their application to the members of the Armed Forces, Police Force and other Forces charged with the maintenance of public order, be subject to such restrictions as may be prescribed by law in the interests of the proper discharge of their duties and the maintenance of discipline among them."
    },
    {
        "article_id": "ARTICLE 16",
        "summary": "Existing written law and unwritten law to continue in force",
        "text": "(1) All existing written law and unwritten law shall be valid and operative notwithstanding any inconsistency with the preceding provisions of this Chapter. (2) The subjection of any person on the order of a competent court to any form of punishment recognized by any existing written law shall not be a contravention of the provisions of this Chapter."
    },
    {
        "article_id": "ARTICLE 17",
        "summary": "Remedy for the infringement of fundamental rights by executive action",
        "text": "Every person shall be entitled to apply to the Supreme Court, as provided by Article 126, in respect of the infringement or imminent infringement, by executive or administrative action, of a fundamental right to which such person is entitled under the provisions of this Chapter."
    }
]